import random
import sys
from stone_game import stone_game
from radio_game import use_radio
from dinamit_game import use_dinamit
import os


def clear():
    os.system('cls' if os.name == 'nt' else 'clear')

bomb_point = 0
map_point = 0
p = 0
PLAYER = '😟'
WALL = '⬛️'
LADDER = "🔲"
DOOR = '🚪'
FREE = '⬜️'
INVENTORY = [" "]
point_inventory = 0
piece_of_map = "📋"
radio = "📻"
radio_point = 0
file = open("./text_for_game.txt", "r", encoding="utf-8")
a = input("Начать игру ")
b = 0
c = 0
# черновик (🗺️ 📋)

room12 = False
room13 = False
room14 = False
room15 = False
room16 = False
room17 = False
room18 = False
room19 = False



run = True
room1 = [
    ['⬛️','⬛️','⬛️','⬛️','⬛️','⬛️','⬛️','⬛️','⬛️','⬛️','⬛️','⬛️','⬛️','⬛️','⬛️'],
    ['⬛️','⬜️','⬜️','⬜️','⬜️','⬜️','⬜️','⬜️','⬜️','⬜️','⬜️','⬜️','⬜️','⬜️','⬛️'],
    ['⬛️','⬜️','⬜️','⬜️','⬜️','⬜️','⬜️','⬜️','⬜️','⬜️','⬜️','⬜️','⬜️','⬜️','⬛️'],
    ['⬛️','😟','⬜️','⬜️','⬜️','⬜️','⬜️','⬜️','⬜️','⬜️','⬜️','⬜️','⬜️','⬜️','⬛️'],
    ['⬛️','⬜️','⬜️','⬜️','⬜️','⬜️','⬜️','⬜️','⬜️','⬜️','⬜️','⬜️','⬜️','⬜️','🔲'],
    ['⬛️','⬜️','⬜️','⬜️','⬜️','⬜️','⬜️','⬜️','⬜️','⬜️','⬜️','⬜️','⬜️','⬜️','🔲'],
    ['⬛️','⬜️','⬜️','⬜️','⬜️','⬜️','⬜️','⬜️','⬜️','⬜️','⬜️','⬜️','⬜️','⬜️','⬛️'],
    ['⬛️','⬜️','⬜️','⬜️','⬜️','⬜️','⬜️','⬜️','⬜️','⬜️','⬜️','⬜️','⬜️','⬜️','⬛️'],
    ['⬛️','⬜️','⬜️','⬜️','⬜️','⬜️','⬜️','⬜️','⬜️','⬜️','⬜️','⬜️','⬜️','⬜️','⬛️'],
    ['⬛️','⬛️','⬛️','⬛️','⬛️','⬛️','🔲','🔲','⬛️','⬛️','⬛️','⬛️','⬛️','⬛️','⬛️']
]

room2 = [
    ['⬛️','⬛️','⬛️','⬛️','⬛️','⬛️','⬛️','⬛️','⬛️','⬛️','⬛️','⬛️','⬛️','⬛️','⬛️'],
    ['⬛️','⬜️','⬜️','⬜️','⬜️','⬜️','⬜️','⬜️','⬜️','⬜️','⬜️','⬜️','⬜️','⬜️','⬛️'],
    ['⬛️','⬜️','⬜️','📋','⬜️','⬜️','⬜️','⬜️','⬜️','⬜️','⬜️','⬜️','⬜️','⬜️','⬛️'],
    ['⬛️','⬜️','⬜️','⬜️','⬜️','⬜️','⬜️','⬜️','⬜️','⬜️','⬜️','⬜️','⬜️','⬜️','⬛️'],
    ['🔲','⬜️','⬜️','⬜️','⬜️','⬜️','⬜️','⬜️','⬜️','⬜️','⬜️','⬜️','⬜️','⬜️','🔲'],
    ['🔲','⬜️','⬜️','⬜️','⬜️','⬜️','⬜️','⬜️','⬜️','⬜️','⬜️','⬜️','⬜️','⬜️','🔲'],
    ['⬛️','⬜️','⬜️','⬜️','⬜️','⬜️','⬜️','⬜️','⬜️','⬜️','⬜️','⬜️','⬜️','⬜️','⬛️'],
    ['⬛️','⬜️','⬜️','⬜️','⬜️','⬜️','⬜️','⬜️','⬜️','⬜️','⬜️','⬜️','⬜️','⬜️','⬛️'],
    ['⬛️','⬜️','⬜️','⬜️','⬜️','⬜️','⬜️','⬜️','⬜️','⬜️','⬜️','⬜️','⬜️','⬜️','⬛️'],
    ['⬛️','⬛️','⬛️','⬛️','⬛️','⬛️','⬛️','⬛️','⬛️','⬛️','⬛️','⬛️','⬛️','⬛️','⬛️']
]

room3 = [
    ['⬛️','⬛️','⬛️','⬛️','⬛️','⬛️','⬛️','⬛️','⬛️','⬛️','⬛️','⬛️','⬛️','⬛️','⬛️'],
    ['⬛️','⬜️','⬜️','⬜️','⬜️','⬜️','⬜️','⬜️','⬜️','⬜️','⬜️','⬜️','⬜️','⬜️','⬛️'],
    ['⬛️','⬜️','⬜️','⬜️','⬜️','⬜️','⬜️','⬜️','⬜️','⬜️','⬜️','⬜️','⬜️','⬜️','⬛️'],
    ['⬛️','⬜️','⬜️','⬜️','⬜️','⬜️','⬜️','⬜️','⬜️','⬜️','⬜️','⬜️','⬜️','⬜️','⬛️'],
    ['🔲','⬜️','⬜️','⬜️','⬜️','⬜️','⬜️','⬜️','⬜️','⬜️','⬜️','⬜️','⬜️','⬜️','⬛️'],
    ['🔲','⬜️','⬜️','⬜️','⬜️','⬜️','⬜️','⬜️','⬜️','⬜️','⬜️','⬜️','⬜️','⬜️','⬛️'],
    ['⬛️','⬜️','⬜️','⬜️','⬜️','⬜️','⬜️','⬜️','⬜️','⬜️','⬜️','⬜️','⬜️','⬜️','⬛️'],
    ['⬛️','⬜️','⬜️','⬜️','⬜️','⬜️','⬜️','⬜️','⬜️','⬜️','⬜️','📋','⬜️','⬜️','⬛️'],
    ['⬛️','⬜️','⬜️','⬜️','⬜️','⬜️','⬜️','⬜️','⬜️','⬜️','⬜️','⬜️','⬜️','⬜️','⬛️'],
    ['⬛️','⬛️','⬛️','⬛️','⬛️','⬛️','🔲','🔲','⬛️','⬛️','⬛️','⬛️','⬛️','⬛️','⬛️']
]

room4 = [
    ['⬛️','⬛️','⬛️','⬛️','⬛️','⬛️','🔲','🔲','⬛️','⬛️','⬛️','⬛️','⬛️','⬛️','⬛️'],
    ['⬛️','⬜️','⬜️','⬜️','⬜️','⬜️','⬜️','⬜️','⬜️','⬜️','⬜️','⬜️','⬜️','⬜️','⬛️'],
    ['⬛️','⬜️','⬜️','⬜️','⬜️','⬜️','⬜️','⬜️','⬜️','⬜️','⬜️','⬜️','⬜️','⬜️','⬛️'],
    ['⬛️','⬜️','⬜️','⬜️','⬜️','⬜️','⬜️','⬜️','⬜️','⬜️','⬜️','⬜️','⬜️','⬜️','⬛️'],
    ['⬛️','⬜️','⬜️','⬜️','⬜️','⬜️','📋','⬜️','⬜️','⬜️','⬜️','⬜️','⬜️','⬜️','⬛️'],
    ['⬛️','⬜️','⬜️','⬜️','⬜️','⬜️','⬜️','⬜️','⬜️','⬜️','⬜️','⬜️','⬜️','⬜️','⬛️'],
    ['⬛️','⬜️','⬜️','⬜️','⬜️','⬜️','⬜️','⬜️','⬜️','⬜️','⬜️','⬜️','⬜️','⬜️','⬛️'],
    ['⬛️','⬜️','⬜️','⬜️','⬜️','⬜️','⬜️','⬜️','⬜️','⬜️','⬜️','⬜️','⬜️','⬜️','⬛️'],
    ['⬛️','⬜️','⬜️','⬜️','⬜️','⬜️','⬜️','⬜️','⬜️','⬜️','⬜️','⬜️','⬜️','⬜️','⬛️'],
    ['⬛️','⬛️','⬛️','⬛️','⬛️','⬛️','🔲','🔲','⬛️','⬛️','⬛️','⬛️','⬛️','⬛️','⬛️']
]

room5 = [
    ['⬛️','⬛️','⬛️','⬛️','⬛️','⬛️','⬛️','⬛️','⬛️','⬛️','⬛️','⬛️','⬛️','⬛️','⬛️'],
    ['⬛️','⬜️','⬜️','⬜️','⬜️','⬜️','⬜️','⬜️','⬜️','⬜️','⬜️','⬜️','⬜️','⬜️','⬛️'],
    ['⬛️','⬜️','⬜️','📻','⬜️','⬜️','⬜️','⬜️','⬜️','⬜️','⬜️','⬜️','⬜️','⬜️','⬛️'],
    ['⬛️','⬜️','⬜️','⬜️','⬜️','⬜️','⬜️','⬜️','⬜️','⬜️','⬜️','⬜️','⬜️','⬜️','⬛️'],
    ['⬛️','⬜️','⬜️','⬜️','⬜️','⬜️','⬜️','⬜️','⬜️','⬜️','⬜️','⬜️','⬜️','⬜️','🔲'],
    ['⬛️','⬜️','⬜️','⬜️','⬜️','⬜️','⬜️','⬜️','⬜️','⬜️','⬜️','⬜️','⬜️','⬜️','🔲'],
    ['⬛️','⬜️','⬜️','⬜️','⬜️','⬜️','⬜️','⬜️','⬜️','⬜️','📋','⬜️','⬜️','⬜️','⬛️'],
    ['⬛️','⬜️','⬜️','⬜️','⬜️','⬜️','⬜️','⬜️','⬜️','⬜️','⬜️','⬜️','⬜️','⬜️','⬛️'],
    ['⬛️','⬜️','⬜️','⬜️','⬜️','⬜️','⬜️','⬜️','⬜️','⬜️','⬜️','⬜️','⬜️','⬜️','⬛️'],
    ['⬛️','⬛️','⬛️','⬛️','⬛️','⬛️','⬛️','⬛️','⬛️','⬛️','⬛️','⬛️','⬛️','⬛️','⬛️']
]

room6 = [
    ['⬛️','⬛️','⬛️','⬛️','⬛️','⬛️','🔲','🔲','⬛️','⬛️','⬛️','⬛️','⬛️','⬛️','⬛️'],
    ['⬛️','⬜️','⬜️','⬜️','⬜️','⬜️','⬜️','⬜️','⬜️','⬜️','⬜️','⬜️','⬜️','⬜️','⬛️'],
    ['⬛️','⬜️','⬜️','⬜️','⬜️','⬜️','⬜️','⬜️','⬜️','⬜️','⬜️','⬜️','⬜️','⬜️','⬛️'],
    ['⬛️','⬜️','⬜️','⬜️','⬜️','⬜️','⬜️','⬜️','⬜️','⬜️','⬜️','📋','⬜️','⬜️','⬛️'],
    ['🔲','⬜️','⬜️','⬜️','⬜️','⬜️','⬜️','⬜️','⬜️','⬜️','⬜️','⬜️','⬜️','⬜️','⬛️'],
    ['🔲','⬜️','⬜️','⬜️','⬜️','⬜️','⬜️','⬜️','⬜️','⬜️','⬜️','⬜️','⬜️','⬜️','⬛️'],
    ['⬛️','⬜️','⬜️','⬜️','⬜️','⬜️','⬜️','⬜️','⬜️','⬜️','⬜️','⬜️','⬜️','⬜️','⬛️'],
    ['⬛️','⬜️','⬜️','⬜️','⬜️','⬜️','⬜️','⬜️','⬜️','⬜️','⬜️','⬜️','⬜️','⬜️','⬛️'],
    ['⬛️','⬜️','⬜️','⬜️','⬜️','⬜️','⬜️','⬜️','⬜️','⬜️','⬜️','⬜️','⬜️','⬜️','⬛️'],
    ['⬛️','⬛️','⬛️','⬛️','⬛️','⬛️','🔲','🔲','⬛️','⬛️','⬛️','⬛️','⬛️','⬛️','⬛️']
]

room7 = [
    ['⬛️','⬛️','⬛️','⬛️','⬛️','⬛️','🔲','🔲','⬛️','⬛️','⬛️','⬛️','⬛️','⬛️','⬛️'],
    ['⬛️','⬜️','⬜️','⬜️','⬜️','⬜️','⬜️','⬜️','⬜️','⬜️','⬜️','⬜️','⬜️','⬜️','⬛️'],
    ['⬛️','⬜️','⬜️','⬜️','⬜️','⬜️','⬜️','⬜️','⬜️','⬜️','⬜️','⬜️','⬜️','⬜️','⬛️'],
    ['⬛️','⬜️','⬜️','⬜️','⬜️','⬜️','⬜️','⬜️','⬜️','⬜️','⬜️','⬜️','⬜️','⬜️','⬛️'],
    ['⬛️','⬜️','⬜️','⬜️','⬜️','⬜️','⬜️','⬜️','⬜️','⬜️','⬜️','⬜️','⬜️','⬜️','🔲'],
    ['⬛️','⬜️','⬜️','⬜️','⬜️','⬜️','⬜️','⬜️','⬜️','⬜️','⬜️','⬜️','⬜️','⬜️','🔲'],
    ['⬛️','⬜️','⬜️','⬜️','📋','⬜️','⬜️','⬜️','⬜️','⬜️','⬜️','⬜️','⬜️','⬜️','⬛️'],
    ['⬛️','⬜️','⬜️','⬜️','⬜️','⬜️','⬜️','⬜️','⬜️','⬜️','⬜️','⬜️','⬜️','⬜️','⬛️'],
    ['⬛️','⬜️','⬜️','⬜️','⬜️','⬜️','💣','⬜️','⬜️','⬜️','⬜️','⬜️','⬜️','⬜️','⬛️'],
    ['⬛️','⬛️','⬛️','⬛️','⬛️','⬛️','⬛️','⬛️','⬛️','⬛️','⬛️','⬛️','⬛️','⬛️','⬛️']
]

room8 = [
    ['⬛️','⬛️','⬛️','⬛️','⬛️','⬛️','⬛️','⬛️','⬛️','⬛️','⬛️','⬛️','⬛️','⬛️','⬛️'],
    ['⬛️','⬜️','⬜️','⬜️','⬜️','⬜️','⬜️','⬜️','⬜️','⬜️','⬜️','⬜️','⬜️','⬛️','⬛️'],
    ['⬛️','⬜️','⬜️','⬜️','⬜️','⬜️','⬜️','⬜️','⬜️','⬜️','⬜️','⬜️','⬜️','⬜️','⬛️'],
    ['⬛️','⬜️','⬜️','⬜️','⬜️','⬜️','⬜️','⬜️','⬜️','📋','⬜️','⬜️','⬜️','⬜️','⬛️'],
    ['🔲','⬜️','⬜️','⬜️','⬜️','⬜️','⬜️','⬜️','⬜️','⬜️','⬜️','⬜️','⬜️','⬜️','🔲'],
    ['🔲','⬜️','⬜️','⬜️','⬜️','⬜️','⬜️','⬜️','⬜️','⬜️','⬜️','⬜️','⬜️','⬜️','🔲'],
    ['⬛️','⬜️','⬜️','⬜️','⬜️','⬜️','⬜️','⬜️','⬜️','⬜️','⬜️','⬜️','⬜️','⬜️','⬛️'],
    ['⬛️','⬜️','⬜️','⬜️','⬜️','⬜️','⬜️','⬜️','⬜️','⬜️','⬜️','⬜️','⬜️','⬜️','⬛️'],
    ['⬛️','⬜️','⬜️','⬜️','⬜️','⬜️','⬜️','⬜️','⬜️','⬜️','⬜️','⬜️','⬜️','⬜️','⬛️'],
    ['⬛️','⬛️','⬛️','⬛️','⬛️','⬛️','⬛️','⬛️','⬛️','⬛️','⬛️','⬛️','⬛️','⬛️','⬛️']
]

room9 = [
    ['⬛️','⬛️','⬛️','⬛️','⬛️','⬛️','🔲','🔲','⬛️','⬛️','⬛️','⬛️','⬛️','⬛️','⬛️'],
    ['⬛️','⬜️','⬜️','⬜️','⬜️','⬜️','⬜️','⬜️','⬜️','⬜️','⬜️','⬜️','⬜️','⬜️','⬛️'],
    ['⬛️','⬜️','⬜️','⬜️','⬜️','⬜️','⬜️','⬜️','⬜️','⬜️','⬜️','⬜️','⬜️','⬜️','⬛️'],
    ['⬛️','⬜️','⬜️','⬜️','⬜️','⬜️','⬜️','⬜️','⬜️','⬜️','⬜️','⬜️','⬜️','⬜️','⬛️'],
    ['🔲','⬜️','⬜️','⬜️','⬜️','⬜️','⬜️','⬜️','⬜️','⬜️','⬜️','⬜️','⬜️','⬜️','⬛️'],
    ['🔲','⬜️','⬜️','⬜️','⬜️','⬜️','⬜️','⬜️','⬜️','⬜️','⬜️','⬜️','⬜️','⬜️','⬛️'],
    ['⬛️','⬜️','⬜️','⬜️','⬜️','⬜️','⬜️','⬜️','⬜️','⬜️','⬜️','⬜️','⬜️','⬜️','⬛️'],
    ['⬛️','⬜️','⬜️','⬜️','⬜️','⬜️','⬜️','⬜️','⬜️','📋','⬜️','⬜️','⬜️','⬜️','⬛️'],
    ['⬛️','⬜️','⬜️','⬜️','⬜️','⬜️','⬜️','⬜️','⬜️','⬜️','⬜️','⬜️','⬜️','⬜️','⬛️'],
    ['⬛️','⬛️','⬛️','⬛️','⬛️','⬛️','⬛️','⬛️','⬛️','⬛️','⬛️','⬛️','⬛️','⬛️','⬛️']
]

current_room = room1
player_x = 1
player_y = 3

data = file.read()
print(data)
print("          ....                     ..                          ..                    \n               ...                :.                          .:                      \n                  :             ..                           .:         .......       \n                   ..          :                             :  ........       .==++++\n                     .        -                            .:-:.            -#%*-::   \n                      .:     -                         ..:.               =%=         \n                .:::...........:::.               ..:.                  .%#           \n              .:                    :.         .:.                      .%+===========\n           .-                        ..      -                          --            \n         :.                          .-==========-:.                  ..#             \n       .                         .-:                 :.        .-=:    %.@%           \n  --.        .-=---.           -.                     ..    .-.        %              \n-                   .-.      =                          ==             %              \n                       -.   -                         ::               @              \n                         :-.                       .-                  @              \n                         -.                       :.                    @             \n                        .                       .:                     +@+           :\n                        -             :::.     ..                   *-                \n                        -     .-:.            :=:                -*.                  \n                        .  .-.                   .-:           .+.                    \n                       .-:.                         :.       .*:                      \n.....:::.             :.                              ..    *.                        \n           .....:::..                                  .- *-                          \n                  ..                                    +=                            \n                   :                                   *                              \n                   .:                                 =.                              \n                    ..                                *                               \n                    .:                               =.                               \n                     .                               +                                \n                     ..                              *.                               ")

is_playing = True

while a == "" or a != "":
    while is_playing:
        if c == 1:
            break
        n = input('1. Пробовать связаться с людьми/исследовать пещеру  2. Осмотреть завалы. 3. Сдаться и уйти в депресию     :').lower().split()
        if n == "1":
            exercise = "найдите чем можно связаться с людьми"
            c = 1

        elif n == "3":
            if c == 0:
                print("Какая жалость! У вас были очень хорошие шансы что-то сделать, но вы пали духом и выбрали просто оставить выбор судьбе. Остается надеяться, что вас найдут.")
                s = random.randint(1, 10)
                if s <= 3:
                    print("вас нашли и вытащили на свободу")
                    sys.exit()
                else:
                    print("вы скончались от голода, жажды и печали. Возможно позже кто-нибудь найдет ваше тело и придаст земле ")
                    sys.exit()
                    is_playing = False
        elif n == "2":
            print("Вы подходите к завалу камней. Ранее здесь был вход, через который вы сюда и попали, но теперь это просто груда пыльного булыжника. Интересно, получится ли её расчистить? Обвал был серьезный и, возможно, тут много слоев камня, которыйпридется разгребать целую вечность, но может оказаться, что на освобождение понадобится лишь пара часов.")
            while True:
                s = input("1. Пробовать разгребать камни 2. Пойти искать другие способы выбраться: ").lower().split()
                if s == "1":
                    print("Вообще-то, у вас все шансы справится с этой задачей. Рюкзак полон оборудования, а вы полны опыта. Однако, ваши попытки не приносят результата. Каждый раз разбив и сдвинув камень,вы обнаруживаете, что сверху падают еще камни.")
                    s = input("1. Продолжить рыть 2. Пойти проверить, есть ли другие способы выбраться: ")
                    if s == "1":
                        print("                                                           .=-           =+=.                                   \n                                                       .==:                  .-==-                              \n                                                    .=-                            :==                          \n                                                 -==.                                 =                         \n                                             .==                                      :=                        \n              :---------------:         .-===                                         :=                        \n     .:--==-:                   ::::::::                                               .=:                      \n  :=-                                                                                    .==                    \n:=.                                                                                         ::==.  :==----=-:. .\n:                                                                                               ==-            :\n                                                                                             -=:                \n                                                                                          .=:                   \n                                                                                        -=.                     \n                                                                                     :=:                        \n                                                                            .=======:                           \n                                                                        =+:                                    \n                                                                       =-                                       \n                                                                     :=                                         \n                                        ===++++++==-               .+.                                          \n                           .=++++:                   -+=          --                                           :\n       -+=++-                                            =+-      -                                             \n  .++                                                         ====                                              \n==                                                              =.==.                                          \n                                                                     :=                                         \n                                                                       +                                        \n                                                                       =.                              .=@@@@@# \n                                                                        =.                        -@@@@@%      .\n                                                                         .==.                  =@@*. .@@:       \n                                                                            =.              -@@@:    +@%        \n                                                                            .=           -%@*        @@@.       \n                                                                             =:       .#@@@+         @:@@:      \n                                                                           -**********@@@#===:       ===@@@@%===\n                                                                      +@*:..          -@@@@@%===============:...\n                                                                 =%#=.                -=   =                    \n                                                             +@#:                     -%    -   .-             .\n                                                          *@:                         ++     :*.            =#@#\n                                                       :@+                            %     -. :+:       *@-. .+\n                                                    -@*.                              %                @*.++@@:.\n                                                  .@=                                ++              +%         ")
                        print("Вы видели падающие и сыплющиеся сверху камни, очевидно, что это плохая затея!  \n В какой-то момент обвал повторился и на этот раз засыпало вас. Увы и ах, вы мертвы.\n Конец")
                        is_playing = False
                    else: 
                        break
                elif s == "2":
                    print("вы нашли 2 завал")
                    s = input("1. разгребать завал 2. Пойти на 1 завал: ")
                    if s == 1:
                        stone_game(is_playing)
                        sys.exit()
        
        
    if radio_point == 1:
        radio_point = 2
        print("                                                                                                     \n                     =+=.                                                                       \n                    .:-.                                                        .-*##%%%        \n   :=.      .--      .:.  ..          .:                                    :#@#-.              \n    .:-.     .-:     .:. .=:        .:-                                  .=%*.                   \n      .=.     :-.    .:. ..        .--                                   -%@%%%%%%%%%%%%         \n      .:-.          .-.         .::                                     =+.                     \n         .-.      .==-.........--                                       =+-=-                    \n          .-      :-.           :=                                     .=-::.                    \n                 .-:             .=            ::.                     :=:                       \n    .:::::::     .-:  .:::.       .:      .:--:.                       .=-                       \n                 --  .-. ..:=.    .-   .-=:.                            =+.                      \n                 --  .=+--=:      .-                                    .=#*++++++++++=:        \n          :-.    --               .-                                .=*=:.                       \n       .--      -:               .-                             .-#:                            \n      .:-.       .-:              .-   .:---::-.               .++.                              \n      .:          --.        ..  .:-                         :%.                                 \n                 -:==-------::=--=-.                      .++.                                   \n                .:.                                      %-                                      \n               ::    -:.      .----:::.               ++.                                       \n               ::.   .=:             ..:==:.          %.                                        \n                       .=.                            %:                                         \n                                                      #.                                     \n                                                      *.                                     ")
        input("Прекрасно! Вам очень повезло, что кто-то забыл в пещере рацию. Возможно получится связаться с коллегами  ")
        s = input("1. Попробовать выйти на связь 2. Швырнуть рацию в стену: ").lower().strip()
        if s == '1':
            use_radio(is_playing)
        if s == '2':
            print("Теперь у вас нет рации. ")
        
    found_piece_of_map = False
    for row in room2:
        for cell in row:
            if cell == '📋':
                found_piece_of_map = True
    if found_piece_of_map == False:
        if room12 == False: 
            point_inventory += 1
            room12 = True
        
    found_radio = False
    for row in room5:
        for cell in row:
            if cell == '📻':
                found_radio = True
    if found_radio == False:
        radio_point += 1 
        

    found_piece_of_map2 = False
    for row in room3:
        for cell in row:
            if cell == '📋':
                found_piece_of_map2 = True
    if found_piece_of_map2 == False:
        if room13 == False: 
            point_inventory += 1
            room13 = True   
            

    found_piece_of_map3 = False
    for row in room4:
        for cell in row:
            if cell == '📋':
                found_piece_of_map3 = True
    if found_piece_of_map3 == False:
        if room14 == False: 
            point_inventory += 1
            room14 = True
        

    found_piece_of_map4 = False
    for row in room5:
        for cell in row:
            if cell == '📋':
                found_piece_of_map4 = True
    if found_piece_of_map4 == False:
        if room15 == False: 
            point_inventory += 1
            room15 = True  

    found_piece_of_map5 = False
    for row in room6:
        for cell in row:
            if cell == '📋':
                found_piece_of_map5 = True
    if found_piece_of_map5 == False:
        if room16 == False: 
            point_inventory += 1
            room16 = True
        

    found_piece_of_map6 = False
    for row in room7:
        for cell in row:
            if cell == '📋':
                found_piece_of_map6 = True
    if found_piece_of_map6 == False:
        if room17 == False: 
            point_inventory += 1
            room17 = True   
            

    found_piece_of_map7 = False
    for row in room8:
        for cell in row:
            if cell == '📋':
                found_piece_of_map7 = True
    if found_piece_of_map7 == False:
        if room18 == False: 
            point_inventory += 1
            room18 = True
        

    found_piece_of_map8 = False
    for row in room9:
        for cell in row:
            if cell == '📋':
                found_piece_of_map8 = True
    if found_piece_of_map8 == False:
        if room19 == False: 
            point_inventory += 1
            room19 = True  
    
    found_bomb = False
    for row in room7:
        for cell in row:
            if cell == '💣':
                found_bomb = True
    if found_bomb == False: 
        bomb_point = 1
        
        

    for row in current_room:
        line = ''
        for cell in row:
            line = line + cell
        print(line)
    if bomb_point != 0:
            print("вы нашли динамит")
            s = input("1. Перетащить динамит к входу в пещеру. 2. Пытаться подорвать, чтобы проломить стену, около которой лежит взрывчатка.: ").lower().split()
            if s == "1":
                print("                                      +             +                                .+                =-       \n                                                   =.                                  =                .+      \n                =                                  +.                                  .=                 =     \n               =:                                  =                                    .=                 =    \n              =.                                                    .@@@@@@@@@@#         =:                 =. \n             =:                                                  .@@%#          @@%       =                 :=  \n            =.               .+                                .@@   #    :@%  :@@@@@     :=                 =  \n           =.                =                                :@* =@ @    #       =@%@     -:                := \n           +                .-                               =@=     =@   *        .@=@.    =.                =.\n           +                =:                   :@@@@@@@@@@ @@   @@@#@=  *        .@ @*     =                .-\n           +                =                =@@@.          #@@+  +  =.%+ #        .@ %@     :=                =\n           +                =              @@*                 +@@*@@@  *@ @@@@@@@@.  %@      -:               =\n           +               :.            %@#                     .@@     ##           @*       =               -\n           +               +.           @@                         @@.     -@@:      =@.       .=              -\n           +              :=           @%                           #@.     %@@*@@% %@          -.             -\n           +              -           @@                             =@           -@@            =.            -\n           +              -          =@-                              @+        @@@               =            -\n           +              -          +@                               @@@@@@@@@@.                 :=           -\n           .-             -          @@                                @.                          =.          -\n            =             .=         @@                                @.                          ::          -\n            =:             =         +@                               @@                            =          -\n             =             ::        =@-                              @+                            =          -\n             =              =         @@                             =@.          =                 =          -\n             :-             =.         @%                           =@.           =                 =          -\n                             =          @@                         #@:           --                =:          -\n                             .-          @@+                     .@@.            =                =            -\n                                           @@=                 -@@:             ::                             -\n                                             *@@*           +@@%                =                              =\n:=:                                            .+@@@@@@@@@@.                  =                              .=\n    -+-                --               +                                     =:                                \n    ::                =:              -.                                   -.                                 ")
                print('При попытке поднять динамит, вы обнаруживаете, что он не лучшего качества. \n Обнаружили вы это не лучшим способом. С взрывчаткой в руках, вы подорвались. ПРОИГРЫШ')
                sys.exit()
                is_playing = False
            if s == "2":
                use_dinamit()
                print("Вы подорвали динамит и сумели скрыться от удара. Все идет как по маслу. \n Когда шум прекратился, а пыль осела, вы выбрались из укрытия.")
                while True:
                    s = input("1. Осмотреть открывшееся пространство. 2. Сбегать за оставшимся в другой части пещеры инвентарем: ").lower().split()                            
                    if s == "1":
                        print("В надежде найти спасение вы врываетесь в новую пещеру. \n Перед вами открывается вид на кучу тележек с ископаемыми, разложенное оборудование и все это разрушено. \n Вы слышите крики людей, бегущих на грохот. А вдруг они обвинят вас в разрушениях?")
                        s = input("1. Бежать от людей, пока вас не увидели 2. Бежать к людям на встречу свободе: ").lower().split()
                        if s == "1":
                            print("Вы возвращаетесь в глубь пещеры к тому месту, где остались все ваши вещи (вы оставили их там, чтобы ничего не сломать). В процессе сбора вещей вас нагоняют ваши коллеги, испугавшиеся шума. Они выводят вас из пещеры и вы оказываетесь на долгожданной свободе")
                            sys.exit()
                        elif s == "2":
                            print("Счастье от обретенной свободы переполняет вас. Ваши коллеги страшно удивлены и засыпают вас вопросами.\n Вскоре после высвобождения начальство обвиняет вас в порче многочисленного инвентаря. \n Взрывать динамит было строго запрещено, вами были нарушены многие правила безопасности. Теперь вы должны найти новую работу и выплатить огромный штраф. Удачи)Конец")
                            sys.exit()
                    elif s == "2":
                        print("Вы возвращаетесь в глубь пещеры к тому месту, где остались все ваши вещи (вы оставили их там, чтобы ничего не сломать). В процессе сбора вещей вас нагоняют ваши коллеги, испугавшиеся шума. Они выводят вас из пещеры и вы оказываетесь на долгожданной свободе")      
                        sys.exit()

    if run == True:
        clear()
        print('=== Доступные действия: ===')
        print()
        print('Управление:')
        print('w - идти вверх')
        print('s - идти вниз')
        print('a - идти влево')
        print('d - идти вправо')
        print(f"инвнтарь - {INVENTORY}")
        print("если перед вами катсцена или тект без поля для ввода нажмите ENTER")
        if point_inventory == 8:
            INVENTORY.append("🗺️")
            point_inventory += 1
            print("вы открыли карту!")
        if point_inventory == 9:
            print("карта🗺️ - м")
            map_point = 1
        action = input().lower().strip()

        if action == "f":
            pass

        for y in range(len(current_room)):
            for x in range(len(current_room[y])):
                if current_room[y][x] == PLAYER:
                    player_x = x
                    player_y = y
        
        
        if map_point != 0:
            if action == 'm':
                print("карта")
                if current_room == room1:
                    print("😟🔲🔲\n🔲🔲🔲\n🔲🔲🔲")
                elif current_room == room2:
                    print("🔲😟🔲\n🔲🔲🔲\n🔲🔲🔲")
                elif current_room == room3:
                    print("🔲🔲😟\n🔲🔲🔲\n🔲🔲🔲")
                elif current_room == room4:
                    print("🔲🔲🔲\n😟🔲🔲\n🔲🔲🔲")
                elif current_room == room5:
                    print("🔲🔲🔲\n🔲😟🔲\n🔲🔲🔲")
                elif current_room == room6:
                    print("🔲🔲🔲\n🔲🔲😟\n🔲🔲🔲")
                elif current_room == room7:
                    print("🔲🔲🔲\n🔲🔲🔲\n😟🔲🔲")
                elif current_room == room8:
                    print("🔲🔲🔲\n🔲🔲🔲\n🔲😟🔲")
                elif current_room == room9:
                    print("🔲🔲🔲\n🔲🔲🔲\n🔲🔲😟")

        if action == 'w':
            new_y = player_y - 1
            new_x = player_x
            item = current_room[new_y][new_x]
            if item == WALL:
                pass
            elif item == LADDER:
                current_room[player_y][player_x] = FREE
                if current_room == room1:
                    pass
                elif current_room == room3:
                    current_room = room6
                    current_room[8][6] = PLAYER
                    current_room[9][7] = LADDER
                elif current_room == room4:
                    current_room = room1
                    current_room[8][6] = PLAYER
                    current_room[9][7] = LADDER
                elif current_room == room6:
                    current_room = room3
                    current_room[8][6] = PLAYER
                    current_room[9][7] = LADDER
                elif current_room == room7:
                    current_room = room4
                    current_room[8][6] = PLAYER
                    current_room[9][7] = LADDER
                elif current_room == room9:
                    current_room = room6
                    current_room[8][6] = PLAYER
                    current_room[9][7] = LADDER
            else:
                current_room[player_y][player_x] = FREE
                current_room[new_y][new_x] = PLAYER

        if action == 's':
            new_y = player_y + 1
            new_x = player_x
            item = current_room[new_y][new_x]
            if item == WALL:
                pass
            elif item == LADDER:
                current_room[player_y][player_x] = FREE
                if current_room == room1:
                    current_room = room4
                    current_room[1][6] = PLAYER
                    current_room[0][6] = LADDER
                    current_room[0][7] = LADDER
                elif current_room == room3:
                    current_room = room6
                    current_room[1][6] = PLAYER
                    current_room[0][6] = LADDER
                    current_room[0][7] = LADDER
                elif current_room == room4:
                    current_room = room7
                    current_room[1][6] = PLAYER
                    current_room[0][6] = LADDER
                    current_room[0][7] = LADDER
                elif current_room == room6:
                    current_room = room9
                    current_room[1][6] = PLAYER
                    current_room[0][6] = LADDER
                    current_room[0][7] = LADDER
            else:
                current_room[player_y][player_x] = FREE
                current_room[new_y][new_x] = PLAYER

        if action == 'a':
            new_y = player_y
            new_x = player_x - 1
            item = current_room[new_y][new_x]
            if item == WALL:
                pass
            elif item == LADDER:
                current_room[player_y][player_x] = FREE
                if current_room == room2:
                    current_room = room1
                    current_room[4][13] = PLAYER
                    current_room[4][14] = LADDER
                    current_room[5][14] = LADDER
                elif current_room == room3:
                    current_room = room2
                    current_room[4][13] = PLAYER
                    current_room[4][14] = LADDER
                    current_room[5][14] = LADDER
                elif current_room == room6:
                    current_room = room5
                    current_room[4][13] = PLAYER
                    current_room[4][14] = LADDER
                    current_room[5][14] = LADDER
                elif current_room == room8:
                    current_room = room7
                    current_room[4][13] = PLAYER
                    current_room[4][14] = LADDER
                    current_room[5][14] = LADDER
                elif current_room == room9:
                    current_room = room8
                    current_room[4][13] = PLAYER
                    current_room[4][14] = LADDER
                    current_room[5][14] = LADDER
            else:
                current_room[player_y][player_x] = FREE
                current_room[new_y][new_x] = PLAYER

        if action == 'd':
            new_y = player_y
            new_x = player_x + 1
            item = current_room[new_y][new_x]
            if item == WALL:
                pass
            elif item == LADDER:
                current_room[player_y][player_x] = FREE
                if current_room == room1:
                    current_room = room2
                    current_room[4][1] = PLAYER
                    current_room[4][0] = LADDER
                    current_room[5][0] = LADDER
                elif current_room == room2:
                    current_room = room3
                    current_room[4][1] = PLAYER
                    current_room[4][0] = LADDER
                    current_room[5][0] = LADDER
                elif current_room == room5:
                    current_room = room6
                    current_room[4][1] = PLAYER
                    current_room[4][0] = LADDER
                    current_room[5][0] = LADDER
                elif current_room == room7:
                    current_room = room8
                    current_room[4][1] = PLAYER
                    current_room[4][0] = LADDER
                    current_room[5][0] = LADDER
                elif current_room == room8:
                    current_room = room9
                    current_room[4][1] = PLAYER
                    current_room[4][0] = LADDER
                    current_room[5][0] = LADDER
            else:
                current_room[player_y][player_x] = FREE
                current_room[new_y][new_x] = PLAYER

        if action == '✨':
            current_room[player_y][player_x + 1] = FREE
file.close()
        